Revit 2025 API
AnalyticalSystemDomain Enumeration
 The domain type of analytical system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AnalyticalSystemDomain
Public Enumeration AnalyticalSystemDomain
public enum class AnalyticalSystemDomain
type AnalyticalSystemDomain
Members
Member name | Value | Description
WaterLoop | 0
AirSystem | 1
ElectricalSystem | 2
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace